---
kind: method
id: M:Autodesk.Revit.DB.PolyLine.Clone
zh: 多段线、折线
source: html/c1e2db50-ba70-1a89-95d6-9b504aa41e21.htm
---
# Autodesk.Revit.DB.PolyLine.Clone Method

**中文**: 多段线、折线

Returns a copy of this polyline.

## Syntax (C#)
```csharp
public PolyLine Clone()
```